# Задача 16.9.1:

# Создайте класс одной из геометрических фигур (например, прямоугольника), где в
# конструкторе задаются атрибуты:  начальные координаты x, y, width и height (или
# другие в зависимости от выбранной фигуры).

# Создайте метод, который возвращает атрибуты прямоугольника как строку (постарайтесь
# применить магический метод __str__). Для объекта прямоугольника со значениями
# атрибута x = 5, y = 10, width = 50, height = 100 метод должен вернуть строку
# Rectangle : 5, 10, 50, 100.

# Решение:

class Trapezoid:
    def __init__(self, x, y, a, b, h):
        self.x = x
        self.y = y
        self.a = a
        self.b = b
        self.h = h

    def __str__(self):
        return f"Trapezoid: {self.x}, {self.y}, {self.a}, {self.b}, {self.h}"


# Задача 16.9.2:

# Напишите код для описания геометрической фигуры.
# Создайте класс «прямоугольник» с помощью метода init(). На выходе в консоли вам
# необходимо получить площадь данной фигуры.

    # Я решила, что прямоугольников уже достаточно, и взяла за основу трапецию.
    # Надеюсь, я правильно поняла задание и нужно действительно создать просто
    # класс для описания одной геометрической фигуры, а не дополнительно фигуры
    # и прямоугольника.

# Решение:

    def get_area_trapezoid(self):
        return (self.a + self.b)/2 * self.h